<a href="https://colab.research.google.com/github/nabillarmdhn/praktikum_Orbit-Guru-Gen-Y/blob/main/Copy_of_Exercises_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Import library

In [ ]:
import pandas as pd
import numpy as np

## Manipulating Data with Series

In [ ]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd']) # membuat 1 kolom dengan berindex a, b, c, d
s

a    3
b   -5
c    7
d    4
dtype: int64

In [ ]:
series = pd.Series([1, 0.5, 4, 5.5, 'lima']) # membuat 1 kolom yang berisi beberapa type data
series

0       1
1     0.5
2       4
3     5.5
4    lima
dtype: object

In [ ]:
ss = pd.Series([1.4, 5.6, 3, 3, 6], [1, 2, -3, 4, 5])
ss

 1    1.4
 2    5.6
-3    3.0
 4    3.0
 5    6.0
dtype: float64

### Mengambil atau memilih kolom tertentu pada series

In [ ]:
s

a    3
b   -5
c    7
d    4
dtype: int64

In [ ]:
s[~(s > 1)] # mengambil nilai, dimana negasi dari s > 1 atau s bukan > 1

b   -5
dtype: int64

In [ ]:
s[(s < -1) | (s > 3)] # mengambil nilai, dimana s < -1 atau s > 3

b   -5
c    7
d    4
dtype: int64

In [ ]:
s['a'] = 6
s

a    6
b   -5
c    7
d    4
dtype: int64

In [ ]:
s.drop(['a', 'c']) # menghapus label a dan c

b   -5
d    4
dtype: int64

## Manipulating Data with Data Frame

### Membuat dataframe dari suatu series

In [ ]:
df1 = pd.DataFrame(ss)
df1

      0
 1  1.4
 2  5.6
-3  3.0
 4  3.0
 5  6.0

### Membuat dataframe dengan key dan value

In [ ]:
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasília'], 'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### Selection

In [ ]:
s['b'] # memilih var s index b

-5

In [ ]:
df[1:] # memilih kolom 1 sampai terakhir

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [ ]:
df.iloc[[0],[0]] # memilih kolom index 0 dan baris 0

   Country
0  Belgium

In [ ]:
df.iloc[1:,[0]] # memilih kolom 1 sampai terakhir, dan baris index ke-0

  Country
1   India
2  Brazil

In [ ]:
df.iat[0,0] # memilih baris index 0 dan kolom 0

'Belgium'

In [ ]:
df.iat[1,0] # memilih baris index 1 dan kolom 0

'India'

In [ ]:
df.loc[[0], ['Country']] # memilih baris index ke-0 pada kolom Country

   Country
0  Belgium

In [ ]:
df.loc[:,['Capital']] # memilih baris semua index pada kolom Capital

     Capital
0   Brussels
1  New Delhi
2   Brasília

In [ ]:
df.at[0,'Country'] # sama halnya dengan .loc tetapi bedanya 0 merupakan nilai skalar, jadi pengambilan nilai hanya satu

'Belgium'

In [ ]:
df.at[1,'Capital']

'New Delhi'

In [ ]:
df[df['Population'] > 1200000000] # memilih baris (atau kolom) dengan populasi >  1,2 M

  Country    Capital  Population
1   India  New Delhi  1303171035

In [ ]:
# df.ix[1,'Capital']
df.loc[1,'Capital']

'New Delhi'

Atribut dan Method Data Frame lainnya

In [ ]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [ ]:
df.drop('Country', axis=1) # menghapus kolom Country

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [ ]:
df.sort_index() # mengurutkan berdasarkan index

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [ ]:
df.rank() # menentukan peringkat

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [ ]:
df.sort_values(by='Country') # mengurutkan kolom Country berdasarkan nilai

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [ ]:
df.shape # untuk mengetahui jumlah baris dan kolom

(3, 3)

In [ ]:
df.index # untuk mengetahui index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.columns # untuk mengetahui nilai

Index(['Country', 'Capital', 'Population'], dtype='object')

In [ ]:
df.info() # untuk mengetahui info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [ ]:
df.count() # menghitung jumlah elemen bukan NA / None

Country       3
Capital       3
Population    3
dtype: int64

In [ ]:
df.sum() # menentukan jumlah

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [ ]:
df.cumsum() # menentukan jumlah komulatif berdasarkan grup

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [ ]:
df.min() # menentukan nilai minimum

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [ ]:
df.max() # menentukan nilai maximum

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [ ]:
df.describe() # menampilkan statistik data

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [ ]:
df.mean() # menentukan rata-rata

Population    5.074031e+08
dtype: float64

In [ ]:
df.median() # menentukan nilai tengah

Population    207847528.0
dtype: float64

### Mengimport Data ke Data Frame

In [ ]:
#Contoh mengimport dari web
url = 'https://people.sc.fsu.edu/~jburkardt/data/csv/freshman_kgs.csv'
df2 = pd.read_csv(url)

df2

   Sex   "Weight (Sep)"   "Weight (Apr)"   "BMI (Sep)"   "BMI (Apr)"
0    M               72               59         22.02         18.14
1    M               97               86         19.70         17.44
2    M               74               69         24.09         22.43
3    M               93               88         26.97         25.57
4    F               68               64         21.51         20.10
..  ..              ...              ...           ...           ...
62   M               65               71         22.51         24.45
63   M               75               82         23.69         25.80
64   F               42               49         15.08         17.74
65   M               74               82         22.64         25.33
66   M               94              105         36.57         40.86

[67 rows x 5 columns]

In [ ]:
disney = '/content/Walt_disney_movie_dataset.csv'
data = pd.read_csv(disney)

data

     Unnamed: 0                            title  ... Traditional Simplified
0             0          Academy Award Review of  ...         NaN        NaN
1             1  Snow White and the Seven Dwarfs  ...         NaN        NaN
2             2                        Pinocchio  ...         NaN        NaN
3             3                         Fantasia  ...         NaN        NaN
4             4             The Reluctant Dragon  ...         NaN        NaN
..          ...                              ...  ...         ...        ...
447         447     Chip 'n Dale: Rescue Rangers  ...         NaN        NaN
448         448                      Hocus Pocus  ...         NaN        NaN
449         449                           Shrunk  ...         NaN        NaN
450         450                        Pinocchio  ...         NaN        NaN
451         451               Hollywood Stargirl  ...         NaN        NaN

[452 rows x 35 columns]

In [ ]:
data.head()

   Unnamed: 0                            title  ... Traditional Simplified
0           0          Academy Award Review of  ...         NaN        NaN
1           1  Snow White and the Seven Dwarfs  ...         NaN        NaN
2           2                        Pinocchio  ...         NaN        NaN
3           3                         Fantasia  ...         NaN        NaN
4           4             The Reluctant Dragon  ...         NaN        NaN

[5 rows x 35 columns]

In [ ]:
data.tail()

     Unnamed: 0                         title  ... Traditional Simplified
447         447  Chip 'n Dale: Rescue Rangers  ...         NaN        NaN
448         448                   Hocus Pocus  ...         NaN        NaN
449         449                        Shrunk  ...         NaN        NaN
450         450                     Pinocchio  ...         NaN        NaN
451         451            Hollywood Stargirl  ...         NaN        NaN

[5 rows x 35 columns]

In [ ]:
data.columns

Index(['Unnamed: 0', 'title', 'Production company', 'Release date',
       'Running time', 'Country', 'Language', 'Box office',
       'Running time (int)', 'Budget (float)', 'Box office (float)',
       'Release date (datetime)', 'Directed by', 'Written by', 'Based on',
       'Produced by', 'Starring', 'Music by', 'Distributed by', 'Budget',
       'Story by', 'Narrated by', 'Cinematography', 'Edited by', 'Languages',
       'Screenplay by', 'Countries', 'Production companies', 'Color process',
       'Japanese', 'Hepburn', 'Adaptation by', 'Animation by', 'Traditional',
       'Simplified'],
      dtype='object')

In [ ]:
data.describe

<bound method NDFrame.describe of      Unnamed: 0                            title  ... Traditional Simplified
0             0          Academy Award Review of  ...         NaN        NaN
1             1  Snow White and the Seven Dwarfs  ...         NaN        NaN
2             2                        Pinocchio  ...         NaN        NaN
3             3                         Fantasia  ...         NaN        NaN
4             4             The Reluctant Dragon  ...         NaN        NaN
..          ...                              ...  ...         ...        ...
447         447     Chip 'n Dale: Rescue Rangers  ...         NaN        NaN
448         448                      Hocus Pocus  ...         NaN        NaN
449         449                           Shrunk  ...         NaN        NaN
450         450                        Pinocchio  ...         NaN        NaN
451         451               Hollywood Stargirl  ...         NaN        NaN

[452 rows x 35 columns]>

In [ ]:
data.dtypes

Unnamed: 0                   int64
title                       object
Production company          object
Release date                object
Running time                object
Country                     object
Language                    object
Box office                  object
Running time (int)         float64
Budget (float)             float64
Box office (float)         float64
Release date (datetime)     object
Directed by                 object
Written by                  object
Based on                    object
Produced by                 object
Starring                    object
Music by                    object
Distributed by              object
Budget                      object
Story by                    object
Narrated by                 object
Cinematography              object
Edited by                   object
Languages                   object
Screenplay by               object
Countries                   object
Production companies        object
Color process               object
Japanese                   float64
Hepburn                     object
Adaptation by               object
Animation by                object
Traditional                float64
Simplified                 float64
dtype: object

**boleh dicoba untuk analisis data di atas yaaa....**

In [ ]:
# Menganalisis Data mulai dari sini

63877468.30985916

##ThankYou